[[59.872841998122006,30.298265179997802],[59.88164411179918,30.279039105779056],[59.88578547382302,30.260156354314205],[59.917346336506924,30.27079935968532],[59.931133983294814,30.286592206365007],[59.93423541165393,30.34667368829859],[59.92648129516408,30.37963267267359],[59.92441322360459,30.391648969060302],[59.93423541165393,30.443147382146257],[59.92079378714318,30.470956525212657],[59.8969209854691,30.490681328426298],[59.88501717752543,30.48896471465678],[59.87638855548232,30.44707933868021],[59.86361406972601,30.408283867488805],[59.85359819240415,30.367428459773965],[59.84720717258157,30.34717241729349],[59.84997100795626,30.331036247859885],[59.85308004748462,30.287090935359906]]


ymaps.ready(init);

function init() {
    var myMap = new ymaps.Map("map", {
            center: [55.73, 37.75],
            zoom: 10
        }, {
            searchControlProvider: 'yandex#search'
        });

    // Создаем многоугольник, используя класс GeoObject.
    var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
            // Тип геометрии - "Многоугольник".
            type: "Polygon",
            // Указываем координаты вершин многоугольника.
            coordinates: [
                // Координаты вершин внешнего контура.
								[[59.872841998122006,30.298265179997802],[59.88164411179918,30.279039105779056],[59.88578547382302,30.260156354314205],[59.917346336506924,30.27079935968532],[59.931133983294814,30.286592206365007],[59.93423541165393,30.34667368829859],[59.92648129516408,30.37963267267359],[59.92441322360459,30.391648969060302],[59.93423541165393,30.443147382146257],[59.92079378714318,30.470956525212657],[59.8969209854691,30.490681328426298],[59.88501717752543,30.48896471465678],[59.87638855548232,30.44707933868021],[59.86361406972601,30.408283867488805],[59.85359819240415,30.367428459773965],[59.84720717258157,30.34717241729349],[59.84997100795626,30.331036247859885],[59.85308004748462,30.287090935359906]],
                // Координаты вершин внутреннего контура.
                [

                ]
            ],
            // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
            fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
            // Содержимое балуна.
            balloonContent: "Многоугольник"
        }
    }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#00FF00',
        // Цвет обводки.
        strokeColor: '#0000FF',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.5,
        // Ширина обводки.
        strokeWidth: 5,
        // Стиль обводки.
        strokeStyle: 'shortdash'
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myGeoObject);

    // Создаем многоугольник, используя вспомогательный класс Polygon.
    var myPolygon = new ymaps.Polygon([
        // Указываем координаты вершин многоугольника.
        // Координаты вершин внешнего контура.
        [
            [55.75, 37.50],
            [55.80, 37.60],
            [55.75, 37.70],
            [55.70, 37.70],
            [55.70, 37.50]
        ],
        // Координаты вершин внутреннего контура.
        [
            [55.75, 37.52],
            [55.75, 37.68],
            [55.65, 37.60]
        ]
    ], {
        // Описываем свойства геообъекта.
        // Содержимое балуна.
        hintContent: "Многоугольник"
    }, {
        // Задаем опции геообъекта.
        // Цвет заливки.
        fillColor: '#00FF0088',
        // Ширина обводки.
        strokeWidth: 5
    });

    // Добавляем многоугольник на карту.
    myMap.geoObjects.add(myPolygon);
